[PAD]
[UNK]
[CLS]
[SEP]
[MASK]
3750
648
900
3370
6122
4464
7399
4939
3659
4811
5598
2465
669
2400
5560
299
2109
4893
4411
1699
1519
803
1635
6065
5998
1903
5445
1324
2376
340
4659
3800
5948
1460
1633
1985
6017
2614
3961
1465
5393
4853
2210
5602
6250
3700
5977
2799
4646
7539
4516
2252
7543
6357
151
619
3915
5410
913
7495
6093
5620
4128
5780
5915
7194
4149
3223
2073
307
1375
2662
2490
5491
4490
5296
5036
4269
2106
5858
5330
3686
1394
1667
6045
465
3099
5430
5176
1866
2539
25
4559
6038
192
4704
6248
1141
1080
3272
5028
1567
6831
4190
6104
3618
3374
7010
2859
1702
2119
3166
3530
3605
6407
4525
4822
1099
6644
5659
3772
7186
5589
5510
531
6637
1407
5619
2986
4480
3641
4063
1920
1906
1722
2515
23
5677
910
5778
5689
5736
4124
5011
4167
1070
5310
1767
2212
7377
5612
7509
1018
2595
1736
6835
3263
281
3809
5537
1363
1277
3893
3220
3743
2555
2541
4958
5566
6887
1871
2289
742
2107
2265
3300
4969
5949
2597
6040
6242
4151
4409
5057
512
1066
486
3870
1854
5096
4562
2313
7467
7058
7261
2828
7492
62
5470
3747
7346
4109
6508
5051
2693
2112
7239
7044
5526
5702
3068
6832
6810
3661
4392
1731
7123
2489
2364
1679
2380
3694
5264
4211
6734
3859
6333
6293
1734
6929
6630
6980
6983
4936
6759
3560
2729
6286
3568
1344
1815
4576
1215
6656
7305
1913
1401
4721
7055
1031
5530
7444
2770
5520
761
5284
4231
2304
3792
150
2538
3634
2461
2549
1647
6501
6641
3630
6101
4630
2975
5037
2087
5271
1877
2967
7370
3193
2471
1036
4498
4139
2410
4230
3038
4655
1859
3706
3196
2827
5640
2621
730
4148
1362
4301
3154
2197
6301
3433
4293
1779
1348
3000
3586
450
7039
6289
1279
6453
3335
606
6609
3780
6770
3864
6206
2147
544
5718
1726
2466
1334
2446
4068
623
4967
5122
2058
4333
2923
7255
6469
1641
2717
4216
2674
6713
4261
6405
955
4350
6714
4933
1264
2810
5282
6822
2456
5450
3578
1271
1816
2402
3523
5328
3440
4499
3317
4462
6920
6811
885
7309
2786
4412
290
433
4671
6909
5681
5192
2115
5538
7328
7160
7449
478
5724
3692
922
19
1844
2791
3067
3397
408
134
6485
6654
264
3912
5787
541
2444
670
4599
7403
5041
6178
1241
7349
2891
7212
94
5338
893
3976
656
4046
4326
4180
3971
4902
350
872
868
4321
6012
4181
3018
133
4089
1610
4173
2154
2192
7159
1952
4298
2463
5139
2151
4417
4233
6227
535
4117
6521
2685
6352
4744
3607
2899
4407
1511
6666
2226
671
2435
1605
5178
7400
2695
4531
1582
5397
3585
3242
1219
1580
4105
1258
2974
6740
5505
2282
4125
2042
790
7256
5864
4923
7486
6966
4866
1695
2522
3695
6569
2477
5165
7154
4080
4612
5547
6050
4981
5955
6088
296
6919
4998
4469
5889
3329
3504
6861
5906
5519
1571
4650
116
2029
383
965
2612
4510
5971
4430
1970
3461
6833
2021
4145
3648
3765
3137
3203
4568
265
5006
4741
826
4355
64
5938
1934
6518
6846
4396
2993
3231
2396
2121
5292
5498
7363
3373
2315
7408
4166
3901
314
3508
343
330
1660
6722
5698
2848
3106
6319
6143
4291
4780
847
1457
6886
1146
2448
5744
1999
6689
248
5497
532
2205
5708
736
5099
2004
1227
6014
137
5235
2506
5810
3117
2990
1323
3764
5166
980
7037
5999
4909
3056
5788
6350
5920
3770
3464
920
7528
1116
2970
3342
751
7420
5816
6535
4986
507
3012
3500
4653
3945
1283
4802
7465
1592
3007
5926
3824
794
663
1308
2688
1395
3937
6182
3310
2334
1919
2255
3289
414
6160
6596
7047
1706
7257
1335
88
5226
5988
584
4381
419
4553
810
565
1613
7013
4351
5521
3495
1778
5105
5370
4751
2984
4114
4042
6798
517
974
7354
1043
6043
6854
4819
591
600
5413
6902
4760
827
3019
1951
5221
2499
7327
101
1924
7006
5909
4399
1684
2851
6220
4237
6768
3366
4450
6678
1245
1405
2592
6223
6284
764
3255
2738
3731
7251
127
5803
7436
6985
1724
3051
6235
1351
4053
2348
5562
2968
641
1688
4315
2007
138
4603
4369
3477
5251
1214
5814
2331
3725
3644
7023
2835
4583
2716
3017
4677
3646
5492
2570
3084
1315
220
1735
4768
1132
6930
7366
2378
2918
5063
5984
3481
4302
1899
3396
2528
144
5081
3819
7134
6165
7127
6962
5791
5957
5179
1152
983
1629
2218
211
5688
53
6751
3186
6602
1697
2983
6163
2838
293
4220
3283
6651
2769
1255
304
5801
5839
2316
4040
5693
6973
3134
6176
6515
3227
5117
979
6977
6567
462
7077
3377
4543
3097
2407
1170
936
7091
6725
1379
543
3247
1914
1879
6027
3364
6308
734
7532
3128
6662
7421
902
3956
26
5095
1103
56
569
7042
4036
6899
4542
3987
6015
6695
6760
1730
4858
7373
4595
3501
2230
5881
6560
3844
1889
873
2367
6115
6003
6552
6007
316
2722
3529
7490
894
2328
7147
5389
4202
495
2602
2131
812
6583
4786
2229
5854
5775
3129
6314
5860
3531
4287
7019
6613
4454
4779
4458
2505
3938
3654
404
499
1805
4340
4558
4329
38
69
5997
6908
3775
442
5511
3032
4372
5005
578
5603
197
6482
1991
1247
5660
1327
5288
1061
5623
431
4648
6663
7032
1299
3130
1292
7292
7344
7326
1388
4377
5466
2318
7206
4021
1623
3598
2076
212
2283
5168
3613
1252
3665
5882
3615
1168
4163
7125
2099
245
5617
6167
2399
5396
6968
7330
3860
368
4636
3949
2211
3198
6972
6639
5741
6729
1267
7219
6615
5243
5486
4223
1757
3270
5239
4547
6588
886
2708
1590
3691
3456
2935
4403
3299
6362
1939
1693
2699
6940
4921
5298
3090
1622
3873
2683
4130
1960
5381
5385
3120
4205
6549
83
5436
6004
6543
6047
443
948
3107
36
3469
2397
4183
6631
4354
4876
3515
5335
5495
7507
7458
869
3226
3608
3015
4679
3762
7445
318
2491
7395
3771
1205
5604
5573
7371
6551
657
2023
1154
3994
1946
1232
5883
1891
57
2873
930
1987
7078
5395
4003
2741
1846
6986
4305
1819
1616
659
1250
2776
1274
355
3782
1148
3606
2642
4643
2434
5367
7029
219
6875
4842
7157
6674
677
7025
141
1793
957
1936
5305
5422
7180
2495
2484
3418
4203
4544
5480
5594
3484
1670
5606
3070
5089
2181
6193
6192
5678
6890
2663
7250
7121
5936
1953
1715
6758
4894
6066
6587
4120
652
6888
6390
4413
3148
7117
3066
6649
1129
6063
7254
7393
729
3577
7533
2847
4641
4118
5822
7033
1006
5194
6149
1370
2502
3088
7059
361
4587
4214
3021
5658
2745
1397
5482
632
3155
1814
5935
3442
580
29
2060
3811
3783
1121
5731
349
3436
6671
2145
6393
3040
2727
781
3062
1972
6959
4691
78
2919
4378
2795
463
1746
932
6046
6221
583
3466
7546
5647
4491
7329
5821
3213
763
1518
6905
6417
470
5109
1361
3151
6917
5278
6625
2124
7311
5493
5649
7419
2512
5484
5169
4270
2012
2594
3172
6881
2766
993
5472
3744
5229
6444
6243
3104
3159
1698
2221
216
4486
2655
3479
1743
3055
445
7038
3703
1110
1078
1782
1750
2080
2411
1386
7137
5705
405
177
4628
5610
5535
2196
1500
5574
5426
6704
382
3720
3400
341
4199
5203
2130
1302
2936
5631
1569
5555
5322
3039
4122
5402
3354
5202
6898
7110
2028
2035
2610
1744
6079
3168
2646
6981
3112
2164
7447
3943
5695
100
2576
6296
4065
3482
1865
2730
2524
2024
2393
45
6356
7045
5525
6542
3506
43
252
3257
3215
1941
5134
1907
5950
686
7075
4683
180
6447
4993
796
1081
1963
4778
4941
6748
2091
1618
4829
811
4482
6788
415
3126
5663
2421
3813
628
4626
1956
1915
6325
3766
1294
5600
6127
3651
7544
4832
3189
2511
1206
5986
5121
4987
5648
768
2910
6862
5870
903
4693
3312
6236
6682
317
7129
2768
6078
2429
13
1390
292
518
5964
5333
6037
1425
3080
4784
2415
5872
84
5380
1545
832
4289
7192
3030
998
5277
6298
6389
5295
2279
5502
750
5728
2267
5739
6992
4861
1389
6894
4005
6111
1829
1566
1100
7387
1732
4974
4590
5085
5536
1995
2423
5064
5160
7378
5056
2354
5289
4225
2437
2749
4218
7122
2931
6965
1853
5683
851
505
5190
1459
157
1515
4848
6493
1833
7360
3955
6864
5850
366
889
7451
2120
5474
4851
1014
5847
5644
7144
1516
5770
5374
654
239
2626
3103
3650
3438
3705
4017
571
4123
4030
2879
4976
848
3318
2480
7152
5416
2198
6994
1270
7106
7541
3793
182
5369
634
2842
5799
6658
5513
6203
6324
2329
5716
5234
18
6571
1160
7548
2274
4505
2022
3836
1508
1151
3324
6139
3285
6414
225
2370
5613
3512
2771
1777
4686
5153
5504
938
2046
1242
3724
3681
7527
1211
2346
5469
566
4245
3268
58
7295
4260
6600
3073
4106
3182
3049
6346
339
2525
3966
456
3878
384
1839
2483
1542
1721
5217
4592
6398
420
208
3711
1775
5899
3343
2234
4781
2049
6265
6375
3563
4144
5968
5208
2866
5076
879
7477
2030
2841
4988
457
515
1620
856
3209
3170
6683
760
2656
986
7394
1965
2603
6164
2248
2047
7028
4448
6906
4699
4324
7051
4917
667
4375
5184
1885
7317
5399
3248
5488
1640
3053
1166
1883
6441
5777
1835
6360
4874
660
3533
1158
7213
2976
1057
6119
2214
2127
4836
1291
4878
4150
6445
4002
4906
5651
3503
7383
5694
1402
6175
2519
2275
676
5254
5026
2785
4597
3407
1176
1087
3818
4108
908
4429
482
2473
3319
5621
1758
4022
1304
4927
2070
5804
7475
3749
3472
3004
4334
2474
6283
2068
4743
2564
1832
2998
5361
459
4188
5144
7148
6327
3309
2379
5281
5793
4971
7362
394
6511
6133
2667
2273
4061
1588
3238
3627
5459
3414
4718
2327
5411
489
6011
2702
7513
2908
3978
3784
2647
440
4257
6889
1480
3362
2369
788
4335
6311
4662
4758
554
4337
4700
5257
6956
3430
2487
2728
1022
7088
1855
4018
6272
7008
3111
5242
5514
3988
513
426
4278
4928
6158
853
3444
4801
4274
3689
2556
6267
1265
5917
3583
227
672
6575
1174
5033
4436
7000
3359
5297
7062
2563
740
2762
7479
2867
1060
6996
4386
3620
247
2620
4097
777
7069
5347
4680
5477
4475
4794
802
347
6141
2709
1360
791
2942
6574
3576
6287
6490
3718
4567
1111
2638
5316
5542
2862
5785
4934
5004
1452
4176
2732
5811
5918
1977
6161
6396
5052
5624
3717
2648
6252
6640
4152
7175
3740
5348
7238
7111
778
6817
5468
2439
496
4831
5886
4841
7164
2406
1325
14
4719
4249
7417
2233
4478
5922
3489
6402
1657
2820
2272
1289
3110
758
4657
4871
4750
2420
3360
1343
5834
1320
5247
572
2979
945
895
1603
3842
3212
5931
1827
5125
6474
7520
1818
1268
5501
1514
5591
519
1076
3158
6454
5684
498
4968
2458
4536
1656
194
2988
2586
3349
3742
485
6680
1428
2639
550
2453
5034
5269
1471
1638
4709
4070
60
1737
5391
238
5368
2686
5638
5406
6234
3351
6825
7234
6318
4153
1122
7462
6818
6802
1696
4119
2428
5641
4732
6337
3173
2818
2756
536
4366
7224
2680
1350
646
2582
3899
1220
6738
1858
5017
244
581
1964
6895
6976
1764
6427
5306
4775
2558
6681
1008
1565
2188
6780
2479
5308
6754
1352
645
2772
1564
4431
226
3420
6512
951
6054
3181
5136
2382
7375
2425
2019
2644
136
4402
4007
5746
4908
5581
1981
4835
4052
4276
5753
6946
4083
203
2185
6819
1917
3059
1504
4970
4280
5047
1112
6610
4285
746
6380
3921
5189
2330
3545
697
2290
1973
4728
4374
3125
5709
4191
4930
6391
2682
1474
6431
4157
3851
4675
3982
6000
3745
3344
1287
6144
5823
5438
7510
1107
2179
5383
978
3036
2914
2169
3886
3336
3005
6211
1587
5928
7016
4960
4479
6087
2247
816
2987
1783
3095
1986
2567
523
1760
7109
4515
4232
5087
1096
2431
631
3781
5773
4736
4707
455
562
6916
3425
1396
3727
5592
7210
5824
1090
2350
1184
1604
1550
5656
289
3267
5972
3821
2999
4717
6897
1314
4929
4077
5686
8
5776
3580
6947
167
5961
699
2740
3290
3161
4466
4460
2591
5213
176
4439
1419
1391
6423
4275
5000
6922
7241
2514
4690
7196
4560
6471
3657
2526
5815
2055
3845
7454
7043
3517
7207
561
4951
7017
5206
2363
327
1842
490
3338
6928
843
1536
5884
3679
3152
3093
5691
452
4313
6355
3626
3147
3150
6171
2673
2017
926
4267
5420
3544
5532
2508
4082
3795
1050
5371
5572
4922
2540
5862
3934
1243
7097
2831
6781
3002
4762
2863
7156
1073
4989
1266
785
4782
1497
5979
2005
6800
1127
7540
970
5344
6635
1950
2566
2893
7265
268
2011
6892
5929
1606
1678
2438
5423
2190
1424
5868
7335
6016
4357
7525
4627
6565
1373
2724
5127
2266
4729
5969
560
5960
1142
5475
2202
54
6387
3923
6855
1690
7512
3326
5769
1888
6842
1195
1435
4796
6507
2366
6295
6256
2530
3435
732
4461
4265
1719
4582
1295
4745
6720
5954
6134
7452
2572
1540
6057
5233
5214
4006
35
4194
752
2804
7496
981
152
5907
5200
4912
5618
1002
3167
2209
4767
3253
4695
3266
7483
6504
3455
5118
6108
5937
4169
5182
1791
430
795
715
3643
4761
1718
399
4614
1755
159
438
6500
7222
4310
6036
6487
4034
3778
5720
881
4090
4512
5529
5360
743
4493
6430
3327
6436
338
1892
5215
3914
195
6750
5900
1510
3207
3992
1013
1780
2995
592
3020
2293
642
1047
418
1902
2144
4442
7426
3554
5552
1092
6694
3079
6055
2857
1453
4814
7339
6730
3232
3403
1431
218
1440
711
4748
3614
6799
3603
5050
1631
1741
4757
3200
178
6608
6562
4985
5956
6829
7391
3868
6838
326
1940
3905
7183
1619
817
7353
7169
6472
4255
878
4356
3177
4873
4476
4380
6621
3729
5869
2876
1200
5273
3951
7245
17
228
7150
859
1671
6197
5940
6971
5518
2103
2734
4506
6764
4066
2136
2351
7380
5020
1905
5571
5715
4444
300
3494
1260
1124
6796
253
3528
2852
2691
7208
7493
6510
2761
234
5212
5467
950
739
3952
757
1651
1556
3113
5792
4405
4991
2260
789
2710
4500
7225
611
5274
3850
3385
1065
1745
1023
1916
7197
6582
6513
89
240
119
156
1042
6702
6303
7529
1071
2341
6815
1086
1502
3983
3647
4323
6870
1164
7098
3649
413
128
3716
2714
3280
5690
6032
555
4504
3662
214
3910
5156
3977
1297
2178
4358
2240
6347
4004
1423
6690
6189
2924
7404
1868
4408
4940
4742
6804
3925
6517
3262
4887
5673
2138
3946
4862
2468
332
2345
1221
7300
7001
2139
3856
5714
4055
3141
5636
7226
6830
1191
5003
3345
4611
3371
5258
4382
1251
7015
962
988
2713
2581
2631
1273
5632
4556
4651
6675
6914
6056
254
2140
4575
2394
4766
4031
5340
7299
3918
4914
1769
2231
354
5255
2832
6254
1838
7453
266
2236
5595
7272
5398
6467
5442
4514
5548
3617
2056
1332
3610
5635
4262
337
3054
2172
7410
3313
839
2739
7131
1639
780
7034
6198
3411
230
4896
3855
4234
6364
2156
1416
727
3273
320
6570
3052
1326
891
830
6989
3897
4777
6757
4509
3225
733
112
6784
5317
367
7501
6812
4715
5177
4731
6404
377
1609
1140
741
6335
5668
4973
6893
964
5315
3848
145
3096
1691
6059
529
2422
4623
61
6199
7170
22
6377
6135
6067
5092
5723
2925
2653
4555
610
476
403
5894
411
2945
7116
1105
3447
2562
7096
5895
4720
122
3941
1627
6386
5325
397
1364
469
7464
5082
5512
5974
473
5865
2958
1055
428
4624
149
1645
6244
5379
1928
1278
2064
425
1822
805
1449
187
1826
5970
1547
956
2307
5861
3011
4903
4012
1306
2069
4961
2561
3998
4864
373
3121
6151
5829
2054
2875
3622
500
3416
2359
3146
1072
3631
285
3451
3917
2044
6277
3233
3306
315
3807
724
2964
1163
959
5752
4548
722
6338
7505
4440
5228
4949
2000
6941
3758
1579
7086
4615
5614
4353
4716
7282
2401
4497
7442
7168
2571
336
4565
2356
5697
5205
3294
6845
7424
854
372
1538
975
5813
5129
3022
7534
3969
1102
6379
3320
3825
3721
1648
6949
1486
162
5429
7190
4660
1984
6473
4549
7333
7350
533
3746
6450
1848
5873
939
1347
3406
7310
6591
2874
6878
823
5
3732
2972
2598
2523
574
76
3866
301
1598
2189
6633
5094
6062
7289
6636
1068
4652
2457
3304
6718
4771
6094
4889
7031
2950
6329
4410
2472
7491
449
2629
720
360
5418
1235
5892
6257
1694
2237
6769
6126
2098
6749
4911
3565
3664
907
5059
3057
946
3999
6262
1831
6424
6307
5876
3459
5392
2902
3521
6266
4956
1341
6807
395
698
621
1614
5941
4658
235
1958
3676
6083
933
2288
3986
3265
3728
5578
577
6937
3929
1171
297
3254
7368
5903
5840
2547
3668
3194
6753
7515
6932
2604
3869
257
4843
1563
6142
1733
2798
2358
5433
1234
7012
3108
3567
5133
2391
1089
2778
6790
644
5456
6611
679
3127
1676
6085
5607
7185
1044
3536
4557
2917
682
5634
5010
6660
5071
6292
3271
707
4950
2228
3483
5540
1870
2513
960
1411
103
1248
674
3829
949
6848
5874
1959
804
3562
2809
2721
3653
4799
2299
3973
6762
1849
6809
4574
5417
1529
1787
2141
3083
2132
3894
7361
1451
710
4096
1509
7440
5963
3346
40
4093
5580
2636
1406
2447
7214
6497
564
1938
5762
6840
1931
4852
6771
7381
1544
713
3683
1727
4258
3144
1000
7411
207
762
2901
1669
806
4872
2310
5596
1033
6435
181
1208
6174
2102
579
302
4172
2170
1710
5287
4451
7162
2381
3990
370
7422
4924
7423
1728
850
2705
5137
2027
6684
1489
2337
1901
770
6852
429
852
3595
6233
4273
1716
1307
3340
7188
5887
1417
6557
3109
6850
5074
6128
5901
6545
6847
2765
3670
2253
5107
1199
7223
3572
7469
3328
5115
4578
4299
3131
5674
2929
5123
2938
3445
6868
6020
3
447
3907
6697
2510
1309
5362
468
3518
7216
1792
4517
2814
6785
3965
688
7306
2284
604
3871
1811
3628
5471
1890
7202
1179
3723
7531
4996
7181
324
2
4048
3812
6491
3311
6522
6924
3258
5921
3779
1339
1441
7046
5719
4606
6882
175
2374
5856
6113
728
7523
4763
1650
1674
2123
958
901
1366
5013
797
6506
2781
3558
7318
5093
5405
4416
6214
3216
67
217
2419
2239
1878
5210
3277
3714
2930
2067
2232
586
2249
3023
2531
6988
4722
4712
1157
896
5932
1182
125
4295
5293
6921
4300
1466
1173
6348
835
5733
1298
6900
2706
5106
1966
2892
1595
753
6
5018
5382
2478
3160
6328
622
7446
1045
4776
875
81
115
5751
3415
417
6116
323
1384
1532
7494
2220
6181
4390
3655
5114
5008
1682
2939
3900
6237
1643
6563
1275
2285
2689
1608
2679
1661
3334
5149
927
2291
4078
4168
5256
174
3754
3047
4870
1010
1038
3903
5533
5951
6279
3975
5001
2250
110
7294
2640
7277
6866
4999
3487
551
6156
2038
3427
4640
283
3391
2812
1433
2652
6091
2985
4788
1482
2787
4676
1212
684
6661
1172
6185
1812
5601
1180
7093
912
5404
5687
98
6229
4992
6191
4164
3889
1874
2669
2956
1093
5478
1082
72
6023
59
6733
378
483
653
3139
3960
204
5431
3814
5546
2911
2905
6231
386
6782
887
3426
4702
2504
4916
2937
1685
651
2278
5452
1751
7312
6460
6843
6313
6238
250
5337
5754
479
2485
5549
4824
1525
7405
7285
4175
3667
5311
2166
2045
3698
3499
6594
7519
4817
5848
6455
2692
509
5097
709
4155
1128
5797
3833
2194
1900
1272
4696
2947
2703
1599
5978
233
1948
2006
3734
4522
1753
5261
3462
3542
3940
4730
1004
3443
1546
2953
4014
6857
1978
7535
165
2268
5241
2224
6316
2565
3046
1358
6958
4854
3570
952
693
1594
7094
1823
5088
107
1067
6618
3526
6369
5779
4419
5650
5487
106
5952
5738
1041
118
5186
4059
2113
3449
3153
4437
6140
4789
4584
4239
2752
1458
5461
5352
3854
7084
2167
7179
2944
6580
1921
1961
2796
7498
7061
3756
5171
3592
5147
5517
7332
7459
7301
3808
2665
2339
4494
1084
6099
4
5758
2634
5476
5622
2965
1414
5527
700
3325
164
1481
6147
1496
5796
7345
246
421
3557
3251
4759
7050
4304
5174
4774
7342
1700
5902
1478
3003
5494
3348
1398
7514
7074
7060
1809
2390
943
5637
1522
5947
6334
5152
2032
2117
3006
4015
213
2321
4250
5120
5039
681
7499
5575
4263
4790
2297
1108
2395
5556
7542
3063
3297
504
2105
3275
7275
1923
2432
6153
5819
1196
1856
2182
4982
3383
3474
6679
4821
4812
3428
6805
553
2389
5885
3571
4667
6406
1909
95
3044
2008
2057
4572
5608
4619
731
4642
7288
3947
1864
5019
605
5544
400
6294
295
2254
2616
1296
3805
1378
4110
2033
1367
3408
502
963
5079
7478
7336
2615
6896
4837
2529
1165
5207
7215
2496
4880
6304
774
385
7545
4856
5545
635
4423
7149
6370
620
286
2641
4279
530
4954
558
3984
1840
1383
3722
5032
1028
2227
3596
5506
2963
3392
5628
2834
5703
3485
198
4198
838
6533
6385
3376
4793
6408
5993
2455
6275
2946
3368
3157
3308
4420
74
5113
5191
7100
6787
82
2632
7163
708
1555
7313
1413
6372
3535
3797
6219
7448
6939
70
5270
2223
6084
2527
7243
5443
5366
4397
1056
3081
6659
4739
5223
2940
7461
1256
2583
4705
158
2966
844
6998
2864
6463
4133
6400
1485
5040
1186
1615
841
6481
6264
5657
612
6107
3190
5054
3763
1880
2559
6259
5197
5563
2036
7537
4879
3696
4035
3776
3822
3234
7412
2811
3967
4428
1126
6031
3882
1720
2915
2550
1225
5783
5939
2163
4875
2168
1861
2596
510
3785
5286
6002
2780
831
3957
4897
1461
2039
4342
5851
2507
4178
7120
6026
5263
7067
6462
1749
6786
3087
5835
779
5781
4051
1442
4088
7500
6475
4749
5387
4297
2440
1083
2897
3733
2149
2336
5183
3249
1353
4978
1662
1630
5995
1725
1794
3767
4545
2535
7303
260
1664
1517
3058
5696
1467
2637
24
755
104
4957
185
5128
5825
2996
4131
6064
2951
4221
6100
1175
424
1976
3184
3496
745
7365
2855
5111
1573
643
7142
6874
6345
4580
4596
6483
453
2659
407
2079
4963
4638
79
5567
168
7101
1908
4907
4094
545
5625
4081
1993
345
7171
171
4521
7286
2623
16
3534
7177
4975
557
7118
2800
6821
6539
590
2470
4826
2065
5732
1543
4885
4844
602
3931
6150
2912
540
525
2922
3625
6960
7364
7414
7191
3217
783
4966
2043
3179
6546
1752
191
2894
3769
782
99
4395
6828
1761
7227
4266
1873
6696
6712
6667
1828
169
5162
1882
3753
691
714
5669
123
6162
2973
3419
3959
6616
4834
673
6232
3315
4995
6974
1763
916
3132
863
6365
3219
7036
7103
4327
4534
4944
5990
2575
4797
3379
7409
6531
6418
944
6954
4171
7066
4363
2613
7203
2606
232
6358
5962
3393
4103
4513
2146
1188
6918
6544
2347
5193
5890
3804
3710
4050
1686
6392
615
4215
2129
3061
416
2503
3208
1007
3708
6013
2568
358
3412
1742
918
5048
5942
994
277
5424
1040
2672
5259
7236
143
1432
5349
2978
4895
3115
3933
7304
2081
1410
6439
2751
2718
5652
6556
5131
2707
75
1032
2775
539
1409
570
1475
6239
3086
5376
1576
6622
1974
7530
1005
4639
261
2162
6001
2100
2089
2460
2830
3936
3048
4529
6727
4809
5944
940
3827
6103
695
2320
3025
2332
4689
4487
2599
3286
7176
52
6486
501
4467
2789
1570
4492
2449
6614
690
5415
6429
7184
4137
369
7187
3541
6534
5421
5457
2880
3735
4314
2187
5855
5898
3246
2096
6130
2025
1426
2607
6039
6326
7473
1189
3045
2241
6632
5195
6527
1559
6058
1285
1236
6188
4581
599
3243
2110
7266
864
5761
1030
1666
582
124
448
1652
7470
5981
5727
5407
5444
4538
1801
4935
4079
196
5246
1201
3911
48
6155
4663
2955
222
6883
967
6646
6595
6129
1246
3034
4610
5067
6686
5151
5561
4918
3806
2155
1713
5262
1492
5341
3538
7248
7115
3974
4882
2546
6019
3218
5388
5353
2003
3078
3611
2992
6110
4206
1910
5154
267
2219
6502
6166
2257
4850
4177
3323
6096
2413
1575
2404
1281
793
288
6323
7228
4424
6584
6499
3922
4008
5713
6112
744
5692
2426
3561
3375
3801
5772
3178
1336
1672
6388
3857
4827
4288
799
4000
3492
5409
5667
3826
503
4681
209
5818
2492
6190
3413
6834
637
7341
6033
6090
3071
6415
4530
2793
7124
4507
5653
7441
5086
3876
3604
6744
3331
1328
1400
2152
492
7369
3457
5806
888
1436
7014
6564
5237
3788
1935
2664
6359
1625
6461
6420
3693
4433
4919
4254
3847
4189
837
2486
4752
6255
2980
6218
93
1768
3522
5774
1954
3347
6664
5959
5933
1178
6528
4243
1847
344
3192
6041
6249
1162
548
6035
6858
117
6200
7389
3537
5685
432
4383
5808
1456
6488
7356
6477
1527
4649
4062
5249
1887
303
1046
1149
3964
5022
5924
5605
5679
5155
6950
3369
472
3669
7334
1387
898
5857
7536
5304
2352
2731
3468
704
3075
2160
4984
4364
1860
4449
2957
202
2398
4528
4926
5812
312
6955
3042
1843
3794
2712
821
3228
4607
6904
4060
3010
2200
2774
7406
678
4654
4694
617
5201
5807
6247
7151
6154
3493
4477
2657
2183
4942
2026
2943
4604
5551
1377
3581
2225
1988
4185
2078
1943
3602
2587
2670
2927
6957
7252
4635
1533
7517
6820
924
1382
6877
4625
6434
193
1677
4376
5102
6022
139
32
3065
7141
1313
3591
6576
1305
2309
534
2243
2758
996
3707
2195
2806
461
6121
1925
2063
3549
1796
7258
858
5108
7182
1404
4422
7049
5163
7048
2819
976
6204
5666
3388
6526
2649
4937
1365
3136
1254
2878
1557
6240
1654
6931
7189
911
435
941
917
5905
3507
528
4165
4343
4368
3041
3924
42
5615
6726
5541
1088
4898
3954
6371
7200
6739
6195
2701
5276
1499
4979
4229
3547
4311
4074
6049
588
1632
4041
2933
7235
4159
6102
3573
389
5717
2031
6184
1658
3566
4901
4341
3624
4953
6428
6912
953
20
7114
6331
7274
7398
7229
1109
201
1216
3791
3454
4983
987
5266
4539
4962
6708
5927
765
1537
5680
2408
4618
1190
4348
1810
2114
647
5836
4997
4196
4723
1037
4016
4585
921
1059
6741
845
305
6263
3551
3757
10
5609
1802
573
721
2794
6867
4904
6401
4714
2601
1817
1642
1601
357
4550
3736
1177
3838
1636
1637
359
5219
6746
1290
3016
1097
1872
5225
3556
1230
1634
4033
3240
4533
1493
6194
4142
4026
7244
2443
7135
6117
1572
2840
5735
7432
7508
3239
1159
1740
5272
1851
5967
3237
4783
5584
4569
627
607
2048
5016
4884
4134
862
146
5805
5664
2083
2409
7230
3550
7516
6520
5994
3124
34
393
4756
6529
4174
6225
706
4158
4365
2521
147
4865
1857
3423
3867
5481
4401
4312
5725
6561
1346
1357
2697
7138
3188
6624
5786
1789
1541
2261
7140
3140
2537
365
6341
6880
4098
3206
3759
4025
1894
6601
3588
6440
3013
6590
4349
321
6458
4186
749
3680
3666
1130
5896
5080
2590
6217
346
5586
1421
2635
189
3660
242
6208
6604
3633
2134
6366
1445
3332
6961
3453
961
7064
7502
5646
5706
3116
6525
3579
7
5722
1012
1867
231
3417
6677
1490
3381
5342
718
1762
1213
668
4785
890
1003
4038
4932
4001
1422
6028
3321
973
5303
5384
5198
870
6124
3843
587
6177
6503
294
5820
3175
6773
6538
2898
1506
4242
7081
3875
5062
4385
5483
4857
6074
4092
190
7416
1257
822
3357
1535
4362
2849
4990
1053
3935
6397
2609
4485
7089
3409
6105
5425
7158
3958
2627
5755
6246
2335
7139
2822
7237
2737
696
173
3072
5503
4740
6871
1125
5507
4481
5500
1450
7056
3527
6936
269
3991
613
6628
50
2088
1863
866
3105
6952
1837
4069
3597
5142
5672
2111
1593
4899
675
188
3260
3908
1192
4344
1646
655
4682
4049
4394
7005
798
4737
5053
1596
685
2733
65
2821
1443
6736
1074
2605
322
3682
2126
2377
2534
2014
3450
5965
3828
3211
6993
142
7260
4473
5485
6849
2952
7022
3673
6984
4678
2482
1711
4011
135
3511
5795
2174
251
1770
2675
7068
4713
4240
3390
2412
2805
4328
6647
2720
4591
2015
3100
6665
1611
1617
3138
3363
2053
3008
6999
1578
1039
5434
6071
3895
206
2815
6765
1893
2797
1933
4501
771
5671
4726
6309
6480
4938
6409
7146
6791
6496
215
6505
2302
1399
3690
7119
3204
1218
2735
390
5058
2368
4306
6514
3398
6278
4613
2690
4746
1161
815
999
2259
3944
2773
3786
2322
5661
4347
4920
6097
6910
3677
31
3314
2493
4361
3394
3802
5432
7080
2890
4071
5642
256
7347
4072
6607
120
5049
3037
6717
5372
6839
4200
4338
1342
1898
3834
7472
2928
5279
3229
5943
5170
4084
1123
3927
3480
2900
1034
6209
3183
6030
6987
833
5238
6865
2759
5042
4360
7526
929
2816
909
521
6806
4384
1712
6207
4359
2856
7220
4798
474
6685
972
5250
1707
1558
2344
6605
6363
4058
3441
4085
1628
4644
1209
1075
4633
1319
3919
2886
6261
5453
480
3993
4846
563
2869
2469
968
1754
1781
1498
5138
7488
4674
2961
813
436
1434
6373
6300
3930
3645
3509
471
5173
3559
1487
6813
5354
7270
3287
5312
3553
4773
3601
5831
5280
6775
754
6470
1337
3865
5534
3135
2441
2608
1714
6703
3741
2333
6963
484
33
5323
6648
6212
3156
2750
6761
4830
1185
5350
4045
2311
2405
4588
4438
5734
6479
3519
6793
1852
4608
594
4888
4204
1975
5524
567
6970
5794
2424
5024
4426
2051
5579
6752
7291
2611
6756
5465
255
2850
5175
1549
2668
1703
6705
4389
5265
4107
5313
7205
2618
4634
6933
5490
3684
2654
3890
102
1001
2175
1203
2754
4415
1147
4489
2868
3748
3205
51
3291
6048
7511
2746
3575
7092
5496
205
3372
6443
4445
170
7217
2340
1131
7054
6653
5187
5412
5879
2118
4027
3486
773
3341
665
4009
5867
786
3448
3840
5309
1237
4632
2319
6789
1776
3799
4136
2711
2092
2861
3145
6226
5355
7315
1881
3525
4765
6824
2907
1118
6269
3970
0
6411
2361
4253
3122
6944
4247
5729
2676
568
925
2326
2823
3688
2871
1528
6081
6082
2497
7323
4121
966
4474
4600
2436
4839
2542
5577
6532
2643
1834
5676
7437
4248
5451
4825
2569
1912
2843
1293
6383
5987
4452
2262
2755
4943
460
3968
1505
5528
2954
5832
5707
5643
2481
846
914
262
3353
2536
2962
7463
5670
6540
6437
626
6763
6213
1979
4309
5314
329
1491
5817
434
451
3316
1222
7476
6138
882
6827
2895
4552
1996
3082
3024
1597
2372
6797
1261
2186
7024
860
4146
6803
3410
2137
5038
39
6010
3187
1962
6776
6131
6755
1321
934
2016
114
2462
5742
4905
3926
5539
6844
97
5893
1113
7007
4828
5675
2624
6336
7132
1472
5143
608
5386
3386
4101
1937
1709
4115
6260
3730
1957
6086
1520
4593
4443
7522
3962
3303
131
6476
2982
3803
855
1804
5784
7201
2464
609
3470
7143
4869
905
2557
601
716
6276
6676
1488
7307
4964
2018
3060
1808
3539
1444
630
776
5919
4735
7130
4179
1689
4915
1240
6368
4102
6568
1944
28
3452
3817
4091
4815
6024
5645
108
475
4860
4318
5364
3091
4195
4425
784
6524
4320
467
1895
4414
625
2305
985
6339
4047
1133
5164
5390
5329
1591
6465
493
2817
3963
1368
3751
2206
7297
2836
5845
4602
6808
1507
1484
1683
4666
1845
5343
6577
4948
6498
5148
353
2158
6456
664
1408
2050
3985
4551
4804
111
1875
6344
1765
2916
4684
7402
1069
6766
7133
4733
5199
575
4453
2417
1501
7413
6836
1427
5553
5771
27
5946
1183
4800
1772
271
4387
834
769
2981
1330
1312
488
7172
7218
6095
4727
6395
402
3142
559
6634
121
2826
5299
6901
2837
3637
3879
1930
4855
291
4687
3546
6251
5378
3118
90
6923
2452
2882
376
5172
3050
4754
3820
6114
7287
650
4210
5248
989
694
282
4668
7538
2476
7262
1922
7063
4579
1581
2577
4292
5569
3995
4457
1249
374
237
5075
7242
7107
3656
6270
2553
4747
5849
6230
7337
1824
5030
3195
1788
3839
5904
6034
2303
3230
6179
241
3587
2552
4849
5035
3543
5103
2150
6422
3760
236
5294
2573
44
4980
3642
7030
6555
1310
388
6315
77
552
2085
7372
1354
4772
375
243
2459
6691
2625
3671
3906
4421
5319
2520
6572
735
800
1187
4064
4573
7041
658
2034
5359
935
3029
5002
3584
6801
6891
3638
4706
348
2725
4336
6698
1430
7549
3339
4791
6343
2645
2386
1349
210
7407
4319
3244
4182
4235
5073
2949
6492
2281
3288
1830
6516
5318
6826
928
5700
6935
4264
5230
3877
5031
6044
2960
1687
2177
2403
1393
6953
4537
161
2904
1020
3439
7174
2885
2753
1862
2292
2360
6042
640
5852
1359
3858
6876
308
6351
7087
7302
4629
4972
4913
7351
5414
6586
5365
6873
4099
6687
7503
1439
5757
5327
1098
5358
3726
2932
6743
2651
4398
4039
6742
153
5759
2084
7376
3467
6774
1282
3475
7429
2001
5934
4303
362
2264
4616
4886
2037
3014
1224
3264
4502
1503
1983
6299
310
4527
6523
7390
1318
2451
1202
2909
7397
5682
371
638
5437
1167
5222
1797
1446
4823
3174
3861
5275
840
2009
92
1
1114
3389
4563
4170
3672
7249
1649
4044
6354
5866
3387
1552
6553
7273
725
6851
5077
6907
4138
6879
2430
2276
6942
4532
1748
1464
3382
6495
7004
4511
5112
2948
576
2280
6098
6975
5268
6468
2433
595
3069
5458
6859
616
6642
2338
618
5045
3123
801
7278
6068
6489
2518
4251
3953
1372
5196
2467
7319
5611
7002
2387
3989
4900
7020
4212
6425
1438
6109
6268
692
3612
589
6353
7040
2258
1967
5021
5740
1568
7382
1904
392
6872
7211
2921
2199
2694
3702
3849
969
6554
3077
4332
6657
5236
5245
661
1269
7482
2040
4019
5756
2142
6550
86
7165
2245
4488
4087
7253
66
5463
2742
598
2881
4965
6623
5976
1945
3199
5599
129
7518
522
5180
2516
4331
3293
5516
2600
2671
3222
6120
3892
5665
1723
63
3600
7204
3434
1429
1560
5557
7401
3498
4346
7104
2989
506
319
4994
3350
1495
1135
4601
6599
5587
2588
410
5973
5830
2678
5626
3874
2215
7268
7072
49
3663
1420
6711
5846
5356
6442
4222
68
6652
259
4803
1052
5875
4818
1530
1644
2767
3701
4656
3085
4162
5701
7367
5629
7415
3639
3555
96
4140
6548
2159
3302
3675
71
5267
931
2888
437
5782
4388
6201
5888
3738
6317
3979
4076
6823
6145
224
4540
5224
2617
3564
1021
2180
7418
7076
5991
298
2700
5853
1009
6558
4286
477
1155
6969
7352
4154
2579
1795
1403
3629
2143
705
6222
2532
524
1836
2002
7193
4807
1584
1329
4701
160
7481
4813
7246
6410
2251
5146
649
2122
787
825
865
6619
4056
1773
4838
6672
37
537
5232
2375
7145
4495
273
199
1820
274
4283
3171
5065
1094
4075
6948
3891
4161
6449
5394
3402
511
3640
2324
2165
4945
6413
2442
2760
4810
7085
5447
6645
6146
6349
5711
4252
1990
1455
2994
2854
6716
4156
3863
4724
7267
3490
6159
1244
3593
2860
6446
3789
6215
2128
1886
4073
4370
3774
7358
3035
4868
5749
1115
1554
4524
5015
6412
6494
2176
6519
4710
1600
1153
4881
11
6814
7487
1322
5244
1119
7348
689
4100
2744
3514
4393
7259
792
7166
1229
3773
4890
7284
7308
1896
1136
4631
6186
6927
2628
2488
5911
2548
109
5809
5161
1369
4054
4244
1035
4883
7431
7450
633
4224
4043
6241
3463
508
6061
6170
5357
1911
3074
6196
5419
1238
3031
284
4192
1521
6767
3996
3250
7521
2385
3201
5132
5068
6399
7435
4470
3658
4806
5400
6700
3520
1095
4456
6210
1799
5958
6381
6990
748
6547
4086
2314
7379
3001
5996
5253
4621
6451
6330
3089
2906
6421
5373
1197
5301
2204
2238
4111
2171
6367
1300
3471
5878
2589
2263
5427
4427
6464
3632
3904
2357
6312
7484
7298
2872
4339
2108
766
904
807
2997
4770
1955
6180
3279
5768
3180
5863
1376
6076
7233
5110
2343
5633
2062
6853
229
4840
828
819
5764
3552
4571
5953
351
1169
5167
2101
5454
5240
1798
1024
4345
3752
1138
6053
1392
6978
2077
3380
55
163
6699
1561
6709
2388
1473
2833
5630
1418
5023
6719
5462
2574
3437
1800
5320
4024
5763
179
7280
1104
6137
4554
4977
4535
3880
4711
7290
3337
1665
549
356
2216
2325
4028
1150
3884
5078
6273
3497
2971
2323
4404
1624
997
5798
6152
2294
5992
6593
1204
2418
7281
4010
3505
7209
3697
1673
2802
7247
1303
3399
6721
1340
3589
3761
597
1253
5140
2887
6426
1663
7343
5564
2059
3098
717
4129
5891
3378
4685
1194
2977
3841
441
5844
2585
6592
1989
7466
7276
6384
3261
5523
1786
4160
5290
5760
3942
4227
6778
3619
5252
4959
221
4141
2298
4734
4523
5730
497
2353
3950
7018
5710
7388
3119
5916
7279
947
880
3768
3881
3365
7271
984
2093
6860
3830
3102
2383
7316
6484
3432
1226
6589
1766
4112
5654
1659
6282
629
759
2301
3621
1692
526
5747
6077
5766
6938
7474
3853
5446
6967
680
5568
2287
46
1771
7178
5012
412
1708
6951
3033
3599
7331
5324
1064
5060
4246
5307
2544
6376
814
6816
842
2213
3798
6747
3197
520
636
7430
6148
1316
4284
1982
4863
130
683
624
3164
6732
6006
5104
4465
7320
4564
6169
7443
5464
1968
1942
4187
772
4670
1589
6566
1437
3932
3301
1655
2095
2116
5985
5260
2074
6585
7355
4787
5029
4379
6080
3333
5204
4570
7325
186
3678
1574
5748
1259
1918
3685
2277
6378
3092
5982
2883
1969
4435
379
808
1207
2704
444
4226
687
7322
7195
4546
4322
775
4795
4673
6280
4271
6794
7427
7428
6597
3245
4665
3165
3282
1079
2355
5090
398
15
6216
5585
5983
4708
3582
6075
3846
4352
6612
4371
3367
1469
1551
5044
4637
4520
3421
992
3296
7439
200
3269
2373
6603
4290
6172
6438
423
311
494
1876
7438
6403
5745
3712
4406
9
5116
4605
876
3465
2384
2013
4013
7433
1049
7232
5712
6291
2593
1583
2719
3446
1479
6205
738
4277
41
3431
6745
2554
6320
1927
6021
867
3384
849
1825
30
3831
3913
6863
5565
7338
4688
2066
1675
6620
6183
4201
3473
5141
2148
6432
1784
3928
4764
1701
6136
861
4067
335
6670
6069
3635
2715
6945
4316
279
6072
5069
396
272
4113
1233
2677
5841
6466
6302
21
2269
2969
5072
4947
3358
2813
1841
3191
6132
7321
5930
5157
1288
4503
5597
5912
2041
1463
5508
2173
3405
5800
2362
4808
1385
7263
4577
3026
5531
3687
4664
6394
2779
2896
5449
5014
1992
3281
3322
906
4208
2630
1019
1156
2317
309
2082
2696
7264
4132
7386
4446
2858
2414
3352
5737
5158
3163
3898
6915
1454
2157
363
4594
6728
4769
7003
6029
877
2747
2619
4472
2845
3574
5126
2517
2075
3256
1091
3513
4463
1331
542
391
1381
1106
1621
3027
2246
3810
2020
2807
275
6310
702
4672
6253
3699
47
6841
4127
7471
5828
1607
6598
4400
3401
4238
2684
3305
4296
3888
3460
5570
6051
7052
7009
1790
328
6925
7269
1228
5455
306
5550
1585
1539
2135
5923
7456
3885
5216
2193
7460
7053
1534
1476
3356
331
2201
1738
5285
5509
7113
6979
5439
7136
6332
5283
4645
1143
3872
666
7504
593
3909
2153
4147
1280
2533
5833
5027
2306
719
1477
3101
726
7374
3259
5135
1447
4325
6997
401
6416
7070
87
4432
1134
148
4228
454
1850
2660
4725
990
3224
3114
2086
6274
3292
6943
5218
6926
4447
2681
223
1971
3790
4518
5838
5408
3491
2666
4367
1054
3274
7384
5326
183
723
7090
2445
6723
4820
5843
1026
446
3252
7314
4816
2295
991
5100
703
3210
2824
4669
333
2959
6478
1333
2790
7035
836
6792
829
5061
4135
4256
6911
1926
2010
155
1415
1015
4468
3133
